Consider the following Python dictionary data and Python list labels:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills',
'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes',
'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [79]:
import pandas as df
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills',
'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes',
'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

1. Create a DataFrame birds from this dictionary data which has the index labels.

In [80]:
df=df.DataFrame(data,index=[labels])
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

2. Display a summary of the basic information about birds DataFrame and its data.

In [81]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

3. Print the first 2 rows of the birds dataframe

In [82]:
print(df.head(2))

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

4. Print all the rows with only 'birds' and 'age' columns from the dataframe

In [83]:
print(df['birds'])
print(df['age'])

a        Cranes
b        Cranes
c       plovers
d    spoonbills
e    spoonbills
f        Cranes
g       plovers
h        Cranes
i    spoonbills
j    spoonbills
Name: birds, dtype: object
a    3.5
b    4.0
c    1.5
d    NaN
e    6.0
f    3.0
g    5.5
h    NaN
i    8.0
j    4.0
Name: age, dtype: float64

5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']

In [84]:
print(df['birds'].iloc[2], df['age'].iloc[2])
print(df['age'].iloc[3], df['age'].iloc[3])
print(df['visits'].iloc[7], df['age'].iloc[7])

plovers 1.5
nan nan
2 nan

6. select the rows where the number of visits is less than 4

In [85]:
df[df['visits'] < 4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN

In [86]:
df[df['age'].isnull()]

        birds  age  visits priority
d  spoonbills  NaN       4      yes
h      Cranes  NaN       2      yes

8. Select the rows where the birds is a Cranes and the age is less than 4

In [87]:
df[(df['birds'] == 'Cranes') & (df['age'] < 4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

9. Select the rows the age is between 2 and 4(inclusive)

In [88]:
df[(df['age'] >= 2) & (df['age'] <= 4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

10. Find the total number of visits of the bird Cranes

In [89]:
df[(df['birds'] == 'Cranes') & (df['visits'] > 0)].sum()

birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                 yesyesnoyes
dtype: object

11. Calculate the mean age for each different birds in dataframe.

In [90]:
df[['age']].mean()

age    4.4375
dtype: float64

12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to
return the original DataFrame.

In [96]:
df.loc['k'] = ['eagle', 9, 1, 'yes']
df
df = df.drop('k')
df

           birds  age  visits priority
(a,)      Cranes  3.5       2      yes
(b,)      Cranes  4.0       4      yes
(c,)     plovers  1.5       3       no
(d,)  spoonbills  NaN       4      yes
(e,)  spoonbills  6.0       3       no
(f,)      Cranes  3.0       4       no
(g,)     plovers  5.5       2       no
(h,)      Cranes  NaN       2      yes
(i,)  spoonbills  8.0       3       no
(j,)  spoonbills  4.0       2       no

13. Find the number of each type of birds in dataframe (Counts)

In [92]:
df.groupby(df["birds"]).count()

            age  visits  priority
birds
Cranes        3       4         4
plovers       2       2         2
spoonbills    3       4         4

14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits'
column in ascending order.

In [51]:
sort_by_age = df.sort_values('age')
print(sort_by_age.head())
print("------------------------------------")
sort_by_vists = df.sort_values('visits',ascending=False)
print(sort_by_vists.head())

        birds  age  visits priority
c     plovers  1.5       3       no
f      Cranes  3.0       4       no
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
j  spoonbills  4.0       2       no
------------------------------------
        birds  age  visits priority
b      Cranes  4.0       4      yes
d  spoonbills  NaN       4      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no

15. Replace the priority column values with'yes' should be 1 and 'no' should be 0

In [52]:
df.priority.map(dict(yes=1, no=0))

a    1
b    1
c    0
d    1
e    0
f    0
g    0
h    1
i    0
j    0
Name: priority, dtype: int64

16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.

In [53]:
df.birds.map(lambda x: 'trumpeters' if x=='Cranes' else x)

a    trumpeters
b    trumpeters
c       plovers
d    spoonbills
e    spoonbills
f    trumpeters
g       plovers
h    trumpeters
i    spoonbills
j    spoonbills
Name: birds, dtype: object